Revit 2027 API
DuctFittingAndAccessoryPressureDropData.GetPresureDropItems Method
 Returns the pressure drop items.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<DuctFittingAndAccessoryPressureDropItem> GetPresureDropItems()
Public Function GetPresureDropItems As IList(Of DuctFittingAndAccessoryPressureDropItem)
public:
IList<DuctFittingAndAccessoryPressureDropItem^>^ GetPresureDropItems()
member GetPresureDropItems : unit -> IList<DuctFittingAndAccessoryPressureDropItem>
Return Value
IList<DuctFittingAndAccessoryPressureDropItem>
See Also
Reference
DuctFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace